In [1]:
from typing import List, Tuple
import pandas as pd
from sklearn.ensemble import RandomForestClassifier
from sklearn.model_selection import train_test_split
from sklearn.metrics import accuracy_score, precision_score, recall_score

In [2]:
titanic_data = pd.read_csv("train.csv")
titanic_data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
titanic_data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
titanic_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    object
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(4), object(6)
memory usage: 83.7+ KB

In [5]:
titanic_data['Sex'].unique()

array(['male', 'female', 'Male'], dtype=object)

In [6]:
titanic_data['Age'].isna().sum()

np.int64(177)

In [7]:
from sklearn.impute import KNNImputer

features = ['Pclass', 'Sex', 'SibSp', 'Age']


titanic_data['Sex'] = titanic_data['Sex'].map({
    'male': 0,
    'Male': 0,
    'female': 1
})

titanic_data['Pclass'] = titanic_data['Pclass'].map({
    '1': 1,
    '1st': 1,
    '2': 2,
    '3': 3
})

print(titanic_data['Pclass'].count())
print(titanic_data['Sex'].count())
print(titanic_data['SibSp'].count())

knn_imputer = KNNImputer(n_neighbors = 5)

titanic_data[features] = knn_imputer.fit_transform(titanic_data[features])

891
891
891

In [8]:
titanic_data['Age'].mean()

np.float64(29.38907968574635)

In [15]:
titanic_data[titanic_data['Age'] < 0]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
426,427,1,2.0,"Clarke, Mrs. Charles V (Ada Maria Winfield)",1.0,-28.0,1.0,0,2003,26.0,NaN,S

In [9]:
train = pd.read_csv("train.csv")
train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
test = pd.read_csv("test.csv")
test.columns

Index(['PassengerId', 'Pclass', 'Name', 'Sex', 'Age', 'SipSb', 'Ticket',
       'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [11]:
train.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
test.isna().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SipSb            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [13]:
test['Pclass'].unique()

array(['3', '2', '1', '2nd'], dtype=object)

In [14]:
train['Pclass'].unique()

array(['3', '1', '2', '1st'], dtype=object)